function consult(method) {
  let res = null;
  switch (method) {
    case 'GET':
      res = {
        message: 'ok',
        code: 200,
        data: [
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '你案情描述得不够清晰。总之，如果属于民事纠纷（比如借款等），双方可以通过协商解决，也可以向法院起诉。如果遭遇敲诈勒索等违法情形，可以报警处理。',
            respondent: 'kingbaoz',
            replyTime: '09-17 08:54:35',
            issue:
              '小区收取停车服务费，说不要业主和业主委员会同意，停车费和停车服务费是一个性质吗。',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '',
            respondent: '',
            replyTime: '',
            issue: '家人被殴打住院，牙齿掉了，腰也有问题。这个医院都能有证明。。属于什么案件，能判多久，都有什么损失可以赔偿。',
            issueTime: '09-17 08:54:35',
            status: '未回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '',
            respondent: '',
            replyTime: '',
            issue: '我堂姐的儿子。还有我爸弟弟的两个儿子。篮球场认识的人，单位同事，问我要钱。找我麻烦！',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '没有实质的影响。如果你希望填写，尝试申请，提供亲子鉴定给公安局',
            respondent: '客服',
            replyTime: '09-17 08:54:35',
            issue: '你好，我想问下，我和我老婆去年 在没有办理结婚证前，生下我女儿，在医院开的出生证明 ，因为没有结婚证 只能填写母亲的信息，没有我的，信息资料，前几天我们刚办理了结婚证，要去给女儿上户口，因为出生证明上没我，我的信息，说只能很母亲上，办上户口不会写 父女 关系 我想问下， 不写这个，对以后小孩有没有实质性的影响，谢谢',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '我买的小产权房需要注意什么细节？我们签的是转让协议，集资建房。',
            respondent: '客服',
            replyTime: '09-17 08:54:35',
            issue: '我买的小产权房需要注意什么细节？我们签的是转让协议，集资建房。',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '从法律角度上是可以的。即便是父母，也无权私自处分儿女财产，包括上述房产和拆迁款。',
            respondent: '客服',
            replyTime: '09-17 08:54:35',
            issue: '我想打官司告我母亲。她把我房子卖掉之后吧我的钱黑掉了。把我动迁分下来得钱去买房子。',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '由交警根据事故当时的实际情况划分责任。对交警责任认定书有异议的，可以自交通事故认定书送达之日起三日内,向上一级交警提出书面复核申请。',
            respondent: '客服',
            replyTime: '09-17 08:54:35',
            issue: '我开车右转弯，后面电动三轮车摔倒滑了九米多撞到我的车，交警刚开始说是我三十责任，对方不签字，过了几天交警打电话给我说现在我的是主要责任对方是次要责任，我怀疑对方走关系了   ',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '你案情描述得不够清晰。总之，如果属于民事纠纷（比如借款等），双方可以通过协商解决，也可以向法院起诉。如果遭遇敲诈勒索等违法情形，可以报警处理。',
            respondent: 'kingbaoz',
            replyTime: '09-17 08:54:35',
            issue:
              '小区收取停车服务费，说不要业主和业主委员会同意，停车费和停车服务费是一个性质吗。',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '',
            respondent: '',
            replyTime: '',
            issue: '我堂姐的儿子。还有我爸弟弟的两个儿子。篮球场认识的人，单位同事，问我要钱。找我麻烦！',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '没有实质的影响。如果你希望填写，尝试申请，提供亲子鉴定给公安局',
            respondent: '客服',
            replyTime: '09-17 08:54:35',
            issue: '你好，我想问下，我和我老婆去年 在没有办理结婚证前，生下我女儿，在医院开的出生证明 ，因为没有结婚证 只能填写母亲的信息，没有我的，信息资料，前几天我们刚办理了结婚证，要去给女儿上户口，因为出生证明上没我，我的信息，说只能很母亲上，办上户口不会写 父女 关系 我想问下， 不写这个，对以后小孩有没有实质性的影响，谢谢',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '',
            respondent: '',
            replyTime: '',
            issue: '家人被殴打住院，牙齿掉了，腰也有问题。这个医院都能有证明。。属于什么案件，能判多久，都有什么损失可以赔偿。',
            issueTime: '09-17 08:54:35',
            status: '未回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '',
            respondent: '',
            replyTime: '',
            issue: '家人被殴打住院，牙齿掉了，腰也有问题。这个医院都能有证明。。属于什么案件，能判多久，都有什么损失可以赔偿。',
            issueTime: '09-17 08:54:35',
            status: '未回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '',
            respondent: '',
            replyTime: '',
            issue: '家人被殴打住院，牙齿掉了，腰也有问题。这个医院都能有证明。。属于什么案件，能判多久，都有什么损失可以赔偿。',
            issueTime: '09-17 08:54:35',
            status: '未回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '',
            respondent: '',
            replyTime: '',
            issue: '我堂姐的儿子。还有我爸弟弟的两个儿子。篮球场认识的人，单位同事，问我要钱。找我麻烦！',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '没有实质的影响。如果你希望填写，尝试申请，提供亲子鉴定给公安局',
            respondent: '客服',
            replyTime: '09-17 08:54:35',
            issue: '你好，我想问下，我和我老婆去年 在没有办理结婚证前，生下我女儿，在医院开的出生证明 ，因为没有结婚证 只能填写母亲的信息，没有我的，信息资料，前几天我们刚办理了结婚证，要去给女儿上户口，因为出生证明上没我，我的信息，说只能很母亲上，办上户口不会写 父女 关系 我想问下， 不写这个，对以后小孩有没有实质性的影响，谢谢',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '我买的小产权房需要注意什么细节？我们签的是转让协议，集资建房。',
            respondent: '客服',
            replyTime: '09-17 08:54:35',
            issue: '我买的小产权房需要注意什么细节？我们签的是转让协议，集资建房。',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '从法律角度上是可以的。即便是父母，也无权私自处分儿女财产，包括上述房产和拆迁款。',
            respondent: '客服',
            replyTime: '09-17 08:54:35',
            issue: '我想打官司告我母亲。她把我房子卖掉之后吧我的钱黑掉了。把我动迁分下来得钱去买房子。',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '由交警根据事故当时的实际情况划分责任。对交警责任认定书有异议的，可以自交通事故认定书送达之日起三日内,向上一级交警提出书面复核申请。',
            respondent: '客服',
            replyTime: '09-17 08:54:35',
            issue: '我开车右转弯，后面电动三轮车摔倒滑了九米多撞到我的车，交警刚开始说是我三十责任，对方不签字，过了几天交警打电话给我说现在我的是主要责任对方是次要责任，我怀疑对方走关系了   ',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '你案情描述得不够清晰。总之，如果属于民事纠纷（比如借款等），双方可以通过协商解决，也可以向法院起诉。如果遭遇敲诈勒索等违法情形，可以报警处理。',
            respondent: 'kingbaoz',
            replyTime: '09-17 08:54:35',
            issue:
              '小区收取停车服务费，说不要业主和业主委员会同意，停车费和停车服务费是一个性质吗。',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '',
            respondent: '',
            replyTime: '',
            issue: '我堂姐的儿子。还有我爸弟弟的两个儿子。篮球场认识的人，单位同事，问我要钱。找我麻烦！',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          },
          {
            id: '20190917232300',
            phone: '1338623xxxx',
            caseType: '债权债务',
            region: '杭州',
            answer: '没有实质的影响。如果你希望填写，尝试申请，提供亲子鉴定给公安局',
            respondent: '客服',
            replyTime: '09-17 08:54:35',
            issue: '你好，我想问下，我和我老婆去年 在没有办理结婚证前，生下我女儿，在医院开的出生证明 ，因为没有结婚证 只能填写母亲的信息，没有我的，信息资料，前几天我们刚办理了结婚证，要去给女儿上户口，因为出生证明上没我，我的信息，说只能很母亲上，办上户口不会写 父女 关系 我想问下， 不写这个，对以后小孩有没有实质性的影响，谢谢',
            issueTime: '09-17 08:54:35',
            status: '已回复'
          }
        ]
      };
      break;

    default:
      res = null;
  }
  return res;
}

module.exports = consult;
